/***************************************\
* 本程序由刘仁宇开发
* 开始编写的时间：2021.3.24
* 代码语言：C++
* 预计可以实现的功能：数学统计
* 预计的模块：1、数字之和 2、数字的组数 3、样本方差 4、总体方差 5、样本标准差 6、总体标准差 7、平均值 8、数字的平方和 9、数字的立方和 10、数字的四次方之和 11、数字的最大值 12、数字的最小值 13、残差平方和
* 编写完成时间：2021.3.25
\***************************************/

#include<stdio.h>
#include<stdlib.h>
#include<math.h>
#include<Windows.h>

void info(int a);

int main(int agrc, char* agrv[])
{
	info(1);
	int a;
	printf("请输入数据的组数：");
	scanf_s("%d", &a);
	//此处的a为即将输入的数字的组数
	double b[1000];
	//下面开始导入即将输入的数字（不可多于1000组，否则会使程序出错）
	int i = 0;
	//此处的i为检测输入的数字是第几个数字
	for (i = 0; i < a; i++)
	{
		scanf_s("%lf", &b[i]);	
		//开始按照顺序读取每一个数字
	}
	double c;
	//定义一个变量c,用于储存数字之和的结果
	c = 0;
	//对c进行初始化，赋值为0
	for (i = 0; i < a; i++)
	{
		c = c + b[i];
		//使用数组元素b[i]对c进行累加操作，最终的结果就是数字之和
	}
	//下面开始输出数字之和的结果
	printf("1、数字之和：%lf\n", c);
	//数字的和输出完成
	//下面开始输出数字的组数
	printf("2、数字的组数：%d\n", a);
	//数字的组数输出完成
	//下面开始计算样本的方差
	//首先要定义一个数组d[1000]
	double d[1000];
	//定义一个数e ,用于储存样本的方差
	double e;
	e = 0;
	//对e进行初始化操作
	for (i = 0; i < a; i++)
	{
		d[i] = fabs(b[i] - (c / a));
		//此时的d[i]为每一项的数字与样本平均值之间的差
		e = e + d[i] * d[i];
		//使用数组元素d[i]^2对e进行累加操作,最终的结果除以项数就是样本总体的方差
	}
	printf("3、样本的方差：%lf\n", (e / (a - 1.0)));
	printf("4、总体的方差：%lf\n", (e / a));
	printf("5、样本的标准差：%lf\n", sqrt(e / (a - 1.0)));
	printf("6、总体的标准差：%lf\n", sqrt(e / a));
	printf("7、平均值：%lf\n", (c / a));
	//下面开始计算数字的平方和
	//首先定义一个数组f[i]
	double f[1000];
	//开始定义一个数字g,用于储存数字的平方和
	double g;
	//对于g进行初始化
	g = 0;
	for (i = 0; i < a; i++)
	{
		f[i] = b[i] * b[i];
		//此时的f[i]为b[i]所对应的平方
		g = g + f[i];
	}
	printf("8、数字的平方和：%lf\n", g);
	//开始定义一个数组j[i]
	double j[1000];
	//开始定义一个数字k,用于储存数字的立方和
	double k;
	//对于k进行初始化
	k = 0;
	for (i = 0; i < a; i++)
	{
		j[i] = b[i] * b[i] * b[i];
		//此时的j[i]为b[i]的立方
		k = k + j[i];
	}
	printf("9、数字的立方和：%lf\n", k);
	//定义一个数组m[i]
	double m[1000];
	//开始定义一个数字n，用于储存数字的四次方之和
	double n;
	//对n进行初始化
	n = 0;
	for (i = 0; i < a; i++)
	{
		m[i] = pow(b[i], 4);
		n = n + m[i];
	}
	printf("10、数字的立方和为:%lf\n", n);
	double max;
	double min;
	max = b[0];
	min = b[0];
	for (i = 0; i < a; i++)
	{
		if (min > b[i])
		{
			b[i] = min;
		}
		if (max < b[i])
		{
			b[i] = max;
		}
	}
	printf("11、数字的最大值为：%lf\n", max);
	printf("12、数字的最小值为：%lf\n", min);
	double l;
	l = 0;
	for (i = 0; i < a; i++)
	{
		l = l + pow(d[i], 2);
	}
	printf("13、残差平方和为：%lf\n", l);
	return 0;
}
void info(int a)
{
	printf("本程序由刘仁宇开发，可以进行简单的数学计算\n");
	printf("本程序可以实现的功能：1、数字之和 2、数字的组数 3、样本方差 4、总体方差 5、样本标准差 6、总体标准差 7、平均值 8、数字的平方和 9、数字的立方和 10、数字的四次方之和 11、数字的最大值 12、数字的最小值 13、残差平方和\n");
	printf("即将启动主程序 main.exe");
	printf("正在启动，请稍后");
	Sleep(1000);
	system("cls");
	int i = 0;
	for (a = 0; a < 100; a++)
	{
		for (i = 0; i < a; i++)
		{
			printf(">");
		}
		printf("\n 进度：%d%c", a + 1, '%');
		printf("\n 正在加载，请稍后");
		system("cls");
	}
}
